//循环打印输出1~10之间所有的整数
//声明变量记录初始值
/*var i=1;
while(i<=10){//循环条件
  //循环体
  console.log(i);
  i++;
  
}*/
//练习：使用循环输出30~20之间所有的整数
/*
var a=30;
while(a>=20){//循环条件
  //循环体
  console.log(a);
  a--;
}*/

//练习：循环打印80 75 70 65 60
/*var b=80;
while(b>=60){//循环条件
  //循环体
  console.log(b);
  b-=5;
}*/

//练习：循环打印1~100之间的所有偶数
//使用if判断每个整数是否为偶数
/*var c=1;
while(c<=100){//循环条件
  //循环体
  if(c%2===0){
    console.log(c);
  }
  c++;
}*/

//练习：计算1~100之间所有整数的和
/*var d=1;
var x=0;//定义一个总和
while(d<=100){//循环条件
  //循环体
  x+=d
  //每次加一个值就打印一次
 // console.log(x);
  d++;
}*/
//当循环结束后就打印最后的值
//console.log(x);


//练习：计算1~100之间所有偶数的和
var e=1;
var y=0;
while(e<=100){//循环条件
  //循环体
  if(e%2===0){
	y+=e;
    //console.log(y);
  }
  e++;
}
console.log(y);
